{
    "name": "Sunny Starlette",
    "profile": "/images/authors/sunny-starlette.webp",
    "personalDetails": {
      "birthdate": "April 15, 2005",
      "age": 19,
      "height": "5'6\"",
      "hairColor": "Golden blonde with natural sun-kissed highlights",
      "appearance": "Sunny has a bright and bubbly personality that matches her radiant smile. Her big, expressive blue eyes and freckled nose give her a youthful, approachable vibe. She's always seen with a touch of glitter on her cheeks and a beachy wave in her hair."
    },
    "favorites": {
      "food": "Acai bowls with extra coconut and a drizzle of honey",
      "beachAccessory": "Layered shell necklaces—because you can never have too much ocean-inspired bling"
    },
    "likesDislikes": {
      "likes": [
        "Glitter sunscreen (obviously)",
        "Impromptu beach bonfires",
        "Thrifting for vintage beachwear",
        "Sunsets with pastel skies"
      ],
      "dislikes": [
        "Sand sticking to everything",
        "Overly complicated beauty routines",
        "When the waves mess up her perfectly styled beach waves"
      ]
    },
    "turnOnsTurnOffs": {
      "turnOns": [
        "Confidence that radiates like the sun",
        "A great sense of humor (bonus points if you can make her laugh mid-photo shoot)",
        "Spontaneous adventures, like midnight swims under the stars"
      ],
      "turnOffs": [
        "Negative vibes—there’s no room for that in Sunny’s world",
        "People who litter at the beach (seriously, protect the ocean!)",
        "A lack of enthusiasm for glitter"
      ]
    },
    "horoscope": {
      "sign": "Aries",
      "message": "Blaze Your Own Trail. This month, you’re all about bold moves. Whether it’s rocking a fiery red swimsuit or trying paddleboarding for the first time, let your adventurous spirit lead the way. Pair your confidence with gold accessories for an unstoppable vibe."
    },
    "biographyStatement": "Hey, babes! I’m Sunny Starlette, your go-to girl for all things beachy, sparkly, and fabulous. I grew up soaking up the California sun, and let me tell you—life by the waves is the ultimate vibe. Writing for Beach Fashion Magazine is like a dream come true because I get to share my love for beachwear, confidence, and glitter sunscreen with YOU. When I’m not typing away, you’ll find me hosting dance-offs on the sand, thrifting for vintage sunnies, or perfecting my one-leg pop pose (it’s iconic, trust me). Life’s too short not to sparkle—so let’s shine together! 🌴✨"
  }
  